a = input('Собака короткошерстной породы?')
if a == 'да':
    b = input('Рост собаки менее 50 см?')
    if b == 'да':
        c = input('У собаки короткий хвост?')
        if c == 'да':
            print('английский бульдог')
        else:
            d = input('У собаки длинные уши?')
            if d == 'да':
                print('гончая')
            else:
                e = input('У собаки короткое тело?')
                if e == 'да':
                    print('мопс')
                else:
                    print('чихуахуа')

    else:
        k = input('Собака весит более 50 кг?')
        if k == 'да':
            print('датский дог')
        else:
            print('фоксхаунд')
else:
    b = input('Рост собаки менее 50 см?')
    if b == 'да':
        k = input('У собаки доброжелательный характер?')
        if k == 'да':
            print('кокер - спаниэль')
        else:
            print('ирландский сеттер')
    else:
        v = input('У собаки рост менее 70 см?')
        if v == 'да':
            l = input('У собаки ддинные уши?')
            if l == 'да':
                print('большой вандейский грифон')
            else:
                print('колли')
        else:
            t = input('Окрас рыжий с белыми отметинами?')
            if t == 'да':
                print('сербинар')
            else:
                c = input('белоснежный окрас?')
                if c == 'да':
                    print('ирландский волкодав')
                else:
                    print('ньюфаундленд')